[{"introduction": "BackgroundRash driving, also known as reckless driving, is a traffic violation where an individualwilfully drives in a manner that shows disrespect for the traffic rules that be and putshimself/herself and other road users at risk [1]. According to Colley(A Law Firm in theUSA), there are five (5) main types of reckless driving - speeding, distracted driving,disregard of traffic signals, street racing, and aggressive driving [2]. For the purpose ofthis project, we decided to focus on speeding. This is because that was the only feasibleoption, considering the allowed time frame for this project work, available technologyand financial resources.Speeding is the act of driving faster than is allowed by law in a particular geographicalarea [31. The main aim of this project is to build an integrated system that helps membersof the appropriate regulatory bodies (preferably the Ghana Police) to find and properlysanction road users who tend to defy the law. This system has three (3) main parts - AnEmbedded System, A Server-side API and a client-facing application. The embeddedsystem was built with a camera to serve as a real-time surveillance tool for the state.Videos will be taken of passer-by cars at regular intervals. The computer vision algorithmon the embedded system is responsible for detecting the speed levels of each car that isseen in the video. If a vehicle is realized to be speeding, the car number of that vehicle isextracted and sent to the server-side API for storage and sanctioning. The purpose of theserver-side API is to provide a record of offenders and also the sanctions owed by them.It also interfaces with the client-facing web application that serves as an avenue forauthorized users to update offender records after payment of outstanding sanctions.", "abstract": "Rash Driving Detection System Using Computer VisionThe primary aim of this project is to develop an embedded system that employs imageand video processing algorithms to detect vehicular speeds and flag vehicles that arefound to be moving at speeds greater than the allowed speed limits within specifiedgeographical locations. Vehicles that are flagged for speeding will have relevant detailsextracted from their number plates and sent to the appropriate authorities (the GhanaPolice Service). The final product of this project will go a long way to reduce the numberof road accidents that plague our roads by serving as a driver-conduct regulatorymechanism on our roads.According to City News Room, the government of Ghana loses an approximate amountof $233M every year due to road accidents. It is clear that these road accidents do notonly cost human life but also substantial amounts of money.This project is aimed at building an embedded system that will be placed on our roads totake frequent videos of cars that pass within the line of sight of the camera. These videoswill be initially pre-processed and passed through a computer vision algorithm thatdetects the speed of each vehicle. If a vehicle is found to be speeding, the algorithmextracts the car number from the number plate of the car in question and sends it to anAPI(Application Programming Interface) managed by the appropriate government body(the Ghana Police Service). The API then applies monetary sanctions to the registeredowner of the car which he/she has to pay in order to be able to renew important documentslike roadworthy license and driver's license. This will also serve as another revenue-generating avenue for the state. This system will be hereafter referred to as \"Maakye wo\"a Fante phrase that means «you've been caught\".The Coronavirus pandemic rendered it possible to obtain some needed parts for thesystem and as such the hardware system could not be fully realized. Upon testing of thesystem, we were able to flag speeding vehicles and charge the registered owners.Further work can be done on this in the future. This could include the addition of moretraffic rules such as lane jumping, wrongful overtaking and disregard of traffic signals.1VUndergraduate Thesis - Department of Computer Engineering, 2020", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker7698245258515807072-1649259554478.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624db429b461030023f4d46d", "name": "A RASH DRIVING DETECTION SYSTEM USING COMPUTERVISION SEDEM OUAME AMEKPEWU  INDEX NUMBER:10622243 SAMUEL KOBINA OBENG ANDAM  INDEX NUMBER:10627711", "description": "A RASH DRIVING DETECTION SYSTEM USING COMPUTERVISION", "author": "sedem@gmail.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T15:39:21.312Z", "__v": 0, "id": "624db429b461030023f4d46d"}, {"introduction": "Farm Management, making and executing the choices included in organising and working acultivar for the greatest generation and benefit[1]. Farm Management draws on rural financialmatters for data on costs, markets, rural management, and economic institutions such as rentingand credit. It also draws on plant and animal sciences for information on soils, seed, and fertilizer,on control of weeds, insects, and disease, and rations and breeding; on agricultural engineering forinformation on farm buildings, machinery, irrigation, crop drying, drainage, and erosion controlsystems; and on psychology and sociology for information on human behavior[2]. In making hisdecisions, a farm manager thus integrates information from the biological, physical, and socialsciences. Farm Management is simply the science (and art) of optimizing the use of resources inthe farm component of farm-households,Farm management systems give farmers an instant overview of the day to day weather forecast oryearly history for every field. Advanced detection algorithms alarm farmers if there could be a riskof an insect, pest, or disease occurrence in their fields.Based on the farmers, farm management systems may differ from one farm to another, but thesignificant concern of farm management is the type of farm. The management system suitable forone farm may give unsatisfactory results to another farm.In areas where the manager of farms has a small farm with ample labor, limited capital, and a fewacres of land often faces an acute capital-land management problem. Many essential farm practicesfor intensive land use through multiple cropping, efficient use of irrigation and commercialfertilizer, and selection of chemicals to control insects, diseases, and weeds, all of these arepossible measures for increasing production and income from each unit of land.", "abstract": "FARM MANAGEMENT SYSTEM WITH MACHINE LEARNINGFarm Management is simply the science of optimizing the use of resources in the farm componentof farm-households, Farm management systems give farmers an instant overview of the day to dayweather forecast or yearly history for every field. Based on the farmers, farm management systemsmay differ from one farm to another, but the significant concern of farm management is the typeof farm. The system is designed for the particular need of the farmers to carry out operationssmoothly and effectively. In our system, there is a drone and a drone camera for surveillance offarmland, a web server which stores, processes and delivers web pages to the users, a databaseserver to store data from farmland and system and a weather API to allow access to current weatherdata on farmland. The drone camera after monitoring and obtaining live feeds from the systemtransmits the sensor data and video stream or image capture to the web socket server. Implementedin the system is a Mobile App written in Java and runs on the Android Platform and it provides alive camera feed of what the drone sees when mounted on the drone Platform. The quality of thevideo stream is highly dependent on the Camera Resolution of the Host device and also the qualityof the internet connection, however since a high priority is given to the smoothness of the feed,the system may intentionally degrade the quality of the video feed to maintain the frame rate. Italso provides you with the option of deploying your trained ML models to the cloud for inferenceand testing. The web portal offers an easy to use and intuitive interface for the workers andmanagers to manage operations on the farm. The system gives only two options to the end-userthat is: The Manager who oversees all farm activities and the Employee who is assigned a task towork on the farm. The farmer in the system has many tools to enable him to manage the farm withkeen attention while the employee is just assigned a task and sees to it that it is done. Now in theManager dashboard, the manager can have access to the Live Feeds, Disease Detection, Workersand Task tools. The farmer could use this functionality by just adding an image to the system andthen it detects the possibility of the diseases and also detects how healthy the cocoa pods are.However, the few images we used to train our model gave precise predictions andrecommendations. The images captured and used for system testing were good for the dronecamera due to the picture resolution of the mobile we used.", "document": "", "image": "", "images": [], "rating": 0, "numReviews": 0, "_id": "624ddb0df49988002311f70d", "name": "FARM MANAGEMENT SYSTEM WITH MACHINE LEARNING PARRY BERNARD NANA GYIZIAH10605488ARCHIBALD KWADWO BOATENG  10624285 TANDOH NANA BANYIN 10616484", "description": "FARM MANAGEMENT SYSTEM WITH MACHINE LEARNING", "author": "parry@gmail.com", "category": {"_id": "620fe0e31dde1f957ff1749f", "name": "hardware", "icon": "gear", "color": "blue", "__v": 0, "id": "620fe0e31dde1f957ff1749f"}, "dateCreated": "2022-04-06T18:25:17.049Z", "__v": 0, "id": "624ddb0df49988002311f70d"}, {"introduction": "A drone, in technological terms, is an unmanned aircraft. Drones are moreformally known as unmanned aerial vehicles (UAVs) or unmanned aircraftsystems (UASs). Essentially, a drone is a flying robot that can be remotelycontrolled or fly autonomously through software-controlled flight plans in theirembedded system, working in conjunction with onboard sensors and GPS.Drones are now also used in a wide range of civilian roles ranging from searchand rescue, surveillance, traffic monitoring, weather monitoring, and firefighting,to personal drones and business drone-based photography, as well as videography,agriculture, and even delivery services. We developed a drone control systemwhich maps a land. Our system is capable of switching drone control between theRaspberry Pi and a handheld radio controller as well as switching between hoverand autonomous flight where the drone follows a red target underneath it. As thedecision-making unit, the Raspberry Pi 3 is used to read data from multiplesensors and monitor outputs from a chip to the onboard flight controller using arelay. The method of making observations from images is 3D imaging, known asphotogrammetry mapping. The picture software's output usually consists of a 3Dmap, a 3D drawing or a 3D model with some real object or landmass. A systemforthe collection,storage, manipulation,analysis,management of andpresentation of spatial or geographical information is a geographic informationsystem (GIS).", "abstract": "Drone is classified as an aerial vehicle that does not carry a human operator, usesaerodynamic forces to provide vehicle lifts, can operate independently or remotely, canbe extended or recoverable, and can carry a lethal or non-lethal payload. It is operatedeither individually by on-board computers or by the pilot's remote control on theground. The goal of the Project is to develop and implement the drone for landsurveying and mapping applications, based on the open source Autopilot calledArdupilot framework. Drone flight controller system is simulated and built for landmapping purposes. The Drone control system is developed and simulated in MATLAB/Simulink. The simulation shows the built Drone being run and managed very stably.Microcontroller-based drone control system is also developed. In this case, the Droneused an RC transmitter and receiver for remote operation.Evidence from the literature review and research undertaken indicates that the use ofthe drones makes it possible to cover a wide variety of terrestrial and aerial approachesand that it can supplement or complement other means of surveying and data collection.The usage offers the ability to get close to the target without being stuck on the land, aswell as benefits from the operating environment, as risky, challenging environments canbe reached from a distance. Data can be obtained quicker, faster, easier and more often.Time savings exist at the calculation level, but more time is required for the post-processing of the data relative to terrestrial approaches", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker7446171465190214248-1649269883657.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624ddc7ef49988002311f720", "name": "DRONE FLIGHT CONTROLLER SYSTEM FOR LAND MAPPING AND SURVEY PRISCILLA OWUSU PREMPEH   10616506 GERALD DUGBATEYNAM  10613127 ", "description": "DRONE FLIGHT CONTROLLER SYSTEM FOR LAND MAPPING AND SURVEY", "author": "gerald@gmail.com", "category": {"_id": "620fe0e31dde1f957ff1749f", "name": "hardware", "icon": "gear", "color": "blue", "__v": 0, "id": "620fe0e31dde1f957ff1749f"}, "dateCreated": "2022-04-06T18:31:26.751Z", "__v": 0, "id": "624ddc7ef49988002311f720"}, {"introduction": "In this era of increased accountability for states and schools, the effects of student attendance ontheir learning and grades have become a very relevant topic. There is an increasing demand forgood education institutions to monitor student attendance. Consequently, education institutions areconstantly urged to record and report attendance data in a standard manner to allow comparisonsacross organizations and jurisdictions[1].The key factor in high-quality education is the relationship between attendance and studentachievement[2]. Even though it has been proven by research that student educational successhighly depends on tutor input or influence, chronic absenteeism will reduce the ability of even thebest teacher to provide ideal learning opportunities for students. Consequently, students who attendclass more frequently tend to achieve more than students who do not[3].Attendance data can be used in many ways to make record management more efficient and can beanalyzed to deduce trends and information that can be used in improving education or other sectorsnot related to education. For instance, linking absenteeism data with teacher performance data,student grades and performance can help identify factors that improve and hinder student success.Also, attendance data can be analyzed with other non-educational data to deduce usefulinformation. For instance, it may be useful to analyze the relationship between attendance andclimate in an area to determine how the climate affects student attendance, and consequently, theirperformance.1.0.2 Potential usesThough our project focused on taking and managing attendance records for schools and othereducational institutions, this project can easily be used in workplaces and other similar institutionsfor keeping emplovee attendance records. It can also be used as a security measure in anyestablishment", "abstract": "Real-Time Face Recognition and RFID Attendance SystemRegular attendance is key to giving students the chance and conducive environment to gainknowledge, any failure to attend class interferes with the learning process. While research affirmsthe significance of teacher effectiveness on student academic performance, even the most efficientteachers cannot impact learning if students are not present in class physically or remotely.As the importance of attendance have been stated, the means of recording or tracking of attendingdata is also a key issue. Attendance records are traditionally taken by passing a sheet of paper inclass or mentioning student names and marking responses in a register. This can take too muchtime and effort depending on class size, moreover, the reliability of the papers or registers isquestionable.Face recognition is gradually becoming a very prolific and efficient way of identificationnowadays. It is being adopted by many top companies like Apple, Samsung, Microsoft foridentification and verification of users. We chose to utilize face recognition as a key tool in creatinga more efficient, faster, and highly autonomous attendance record system. Also, by using RFIDtechnology as a supporting tool, we aim to reduce the deficits of face recognition to a minimum.By coupling face recognition and RFID technology we were able to create a better attendancemanagement system that is not only faster and more efficient but also generates and storeselectronic records which is more reliable and easier to perform analysis on.On implementation and testing, we deduced that have more images per person as the dataset,preprocessing images (realigning faces with dib) and tweaking parameters improves positiverecognition rates. Also, some factors like lightning, eyewear, etc. affect both detection andrecognition. Lastly, though our project used one camera for demonstration, we believe havingmultiple cameras mounted at vantage points would also facilitate better performance of the facerecognition system.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker6500999344862205663-1649270154492.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624ddd92f49988002311f726", "name": "Real-Time Face Recognition and RFID Attendance System Kwaku Adusei Okyere - 10628439Francis Kofi Anane Wormenor - 10621755", "description": "Real-Time Face Recognition and RFID Attendance System", "author": "Francis@gmail.com", "category": {"_id": "620fe0e31dde1f957ff1749f", "name": "hardware", "icon": "gear", "color": "blue", "__v": 0, "id": "620fe0e31dde1f957ff1749f"}, "dateCreated": "2022-04-06T18:36:02.341Z", "__v": 0, "id": "624ddd92f49988002311f726"}, {"introduction": "Security is one of the most important topics in every facet such as applications, offices,facilities, industries, schools and in homes. Invasions in these sectors are rapidly increasing.Homes, facilities and business security is a major concern, since every homeowner or facilityowner wants to protect their properties from burglars, armed robbers or any intruders or in short;crime. These owners don't want to just protect their properties; they also want to prevent potentialbreak-ins, destructions and loss of life [1]. Everyone is different which means everyone can beaffected differently or relate differently when they are exposed to crime. Crime can be severe; mostpeople don't suffer any long-term harm. On some occasions, people may develop long-termproblems, such as depression or anxiety-related illnesses, and some people also have severe, long-lasting conditions after a crime is experienced, known as post-traumatic stress disorder (PTSD)[2]. Thankfully there are security systems available that can be installed at homes or industries, toprotect properties from burglars or criminals.Security systems can be defined as systems that detect possible intrusion or unauthorizedentries, by burglars, armed robbers and sometimes assailants. These systems are used at homes,commercial, industries, schools, residential areas and military for protection against burglary ordamage of property, as well as personal protection against intruders [3]. Some security systemsare designed to detect fire or any other hazards. The present system designed, which is the smartintrusion detection, alarm and alert system, focuses on intruders. Most of the security systems usesensors to detect the presence of intruders. They also include alarm devices such as loud speakersor buzzers, that make noise when an intruder is detected. A car alarm system is an example ofsystems that use sensors. These sensors can be integrated into the doors, trunk, and hood of a car,and they allow the control unit to detect whenever someone tries to open anything up to gain accessto the vehicle [4]. With this and many other ways to detect intruders, burglars fail or attempt notto break into buildings.Protection and security of people and properties have always been an important topic. Withthe evolution of technology, the function and capabilities of security systems have also evolved.The concept of burglar alarms dates back thousands of years to a time when dogs were used to", "abstract": "This report contains a proposed system that will ensure that the welfare of the facilities of usersare ensured. Smart intrusion detection, alarm and alert system detects intruders in a facility orhome and sets off an alarm while alerting the owners of the system. To ensure that no false alarmis set off, a facial recognition algorithm is implemented in the system. This facial recognition isachieved using computer vision and machine learning.Robberies are common problems in places where security systems are unavailable. Facilities andhomeowners who have been attacked before, or are victim to such attacks know how terrible itfeels, to discover that someone has broken into your home and stolen your money or properties. Itis important to make people know that such problems can be reduced or be prevented by installingsecurity systems at their homes or facilities, to protect their properties and also prevent potentialbreak-ins by burglars; hence the need for this project.Designing a smart intrusion detection system that can set off an alarm and also alert the ownersof homes remotely, can solve the problem stated above. This system uses a facial recognitionsystem to prevent false alarm. Most systems set off false alarms and this can be a problem. Thesystem also has a Passive Infrared (PIR) sensor to detect the presence of intruders.There are lots of security systems on the market of which most aren't affordable by the averageindividual. Some are easy to install and some are quite the opposite. Some of the systems are lesslikely to prevent false alarm since what they mostly do is detect motion and set off an alarm. Thesystem we have designed is easy to install and very affordable.The system protects valuables, allows remote access to the system, notifies if there's an intrusionand it also helps you keep your mind at peace. The system can be used in residential, commercial,industrial and military properties for protection against intruders.The smart intrusion detection, alarm and alert system is efficient, affordable and easy to install.The system can be further improved for home automation and also used as a potential fire detectoror alarm.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker1563248796978846473-1649270822850.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624de029f49988002311f72c", "name": "SMART INTRUSION DETECTION ALARM AND ALERT SYSTEM KPEGLO EMMANUEL 10628008 TWENEBOANAH RICHMOND MAUNG 10620668", "description": "SMART INTRUSION DETECTION ALARM AND ALERT SYSTEM", "author": "emmanuel@outlook.com", "category": {"_id": "620fe0e31dde1f957ff1749f", "name": "hardware", "icon": "gear", "color": "blue", "__v": 0, "id": "620fe0e31dde1f957ff1749f"}, "dateCreated": "2022-04-06T18:47:05.755Z", "__v": 0, "id": "624de029f49988002311f72c"}, {"introduction": "", "abstract": "A research exercise at various resource-limited hospitals in Ghana revealed that a conventionalmethod of monitoring uterine contractions is employed. This method is time consuming andineffective with a likelihood of misrepresenting data on uterine contractions. Uterine contraction(UC) is an important clinical indictor for monitoring uterine activity. During pregnancy, earlydetection of uterine contractions leading to preterm delivery is crucial for preventing early birth.Constant monitoring of the fetus could help to detect early symptoms and anomalies that can be asign of premature childbirth and other fetal complications that could be of major concern. Duringthe later stages of pregnancy, women go through labour to be able to give birth. One way ofobserving Labour progress is through the monitoring of uterine activities. Uterine contractionsbecome more frequent, last longer and more intense as Labour progresses. Health personals findit difficult to monitor and track the progress of labour. There is therefore a need for a system thatcan potentially overcome the identified challenges.In this project, the proof of concept for development of an automated uterine contractionmonitoring system designed for use. This project seeks to provide an automated system that willmonitor and classify the uterine contractions and notify the health personnel when there are someirregularities with limited human intervention. The proposed system developed provides a way tomonitor uterine contraction during labour. The system records and computes the intensities of theuterine contractions. The recorded data is sent to another system on the desk of the healthpersonnel through a wireless Bluetooth communication. The system classifies records intoregular and irregular contractions and alerts the health personnel when necessary.The developed system was tested and was able to determine parameters that are necessary tomonitor the progress of labour. The system is able to classify recorded uterine contraction results(intensities) and also determine whether contractions are regular or irregular.This project will also be useful for doctors, nurses and other health personals in managing theirpatients. The system developed will provide enormous benefits to users in the monitoring ofuterine contraction and the associated risk and complications during labour.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker2548394948819759527-1649272766251.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624de7c2f49988002311f739", "name": "CLASSIFICATION AND DETECTION OF LABOUR TYPES AGYEMANG ERNEST 10681518  FRIMPONG MICHAEL WARREN 10676296", "description": "CLASSIFICATION AND DETECTION OF LABOUR TYPES", "author": "agyemang@outlook.com", "category": {"_id": "620fe0f11dde1f957ff174a1", "name": "tech", "icon": "solder", "color": "blue", "__v": 0, "id": "620fe0f11dde1f957ff174a1"}, "dateCreated": "2022-04-06T19:19:30.200Z", "__v": 0, "id": "624de7c2f49988002311f739"}, {"introduction": "", "abstract": "Fiber optic communication has become one of the most important parts of moderncommunications due to the rapid development of various applications such as Internet ofthings, internet data and services, medicine and the military. They have excellent dataconveying properties because of their enormous bandwidth and lower attenuation.However, optical fibers sometimes suffer faults to due to some external factors that areout of our control hence, disruptions are unavoidable at some point especially in long haulfiber transmission. Some of these faults include like bends, broken fiber, connectors,splice effects, crack, and breakdowns along an optical fiber.This research reviews a novel technique for measuring transmission characteristics ofoptical fibers used in long haul transmission. We used the Optical Time DomainReflectometer (OTDR) device to detect faults in a fiber link using different distances andevents. It is a standard technique used to investigate the quality of optical fiberinstallations. Therefore, faults such as a splice, break, crack, connector and otherattenuation along an optical fiber can be observed by studying the visual representationon the OTDRs' screen. We also used the Optisystem software to detect faults in long haultransmission using different distances. The simulated results and the experimental resultswere compared with special emphasis on the precision of the fault location and otherfactors.The results obtained show that, the integrity of the signals was good and the locationfaults were achieved which is beneficial to help keep disruptions in the network signalsto a minimum.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker232094978564851653-1649274045710.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624decbef49988002311f745", "name": "FAULT DETECTION USING INTEGRATED OPTICAL TIME-DOMAIN REFLECTOMETER(OTDR) IN LONG HAUL FIBERTRANSMISSION ACHEAMPONG KWADWO DANSO10669985 AKYENA KWAKU SARFO 10671807", "description": "FAULT DETECTION USING INTEGRATED OPTICAL TIME-DOMAIN REFLECTOMETER(OTDR) IN LONG HAUL FIBERTRANSMISSION", "author": "ayena@yahoo.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T19:40:46.790Z", "__v": 0, "id": "624decbef49988002311f745"}, {"introduction": "An android app calledPREEMPT was developed for use by registered emergency vehicle drivers. The PREEMPT appwas designed to provide the driver with the shortest route to an entered destination, as well as sendperiodic updates on location to the control station so that the appropriate actions are taken as andwhen needed. The individual hardware and software models performed as expected. Afterintegration of the hardware and the software, the fulfilled its purpose.", "abstract": "Traffic\" is the term used to describe vehicles moving on a public highway. According toWikipedia, traffic congestion is a condition in transport that is characterized by slower speeds,longer trip times, and increased vehicular queuing. Traffic congestion is a fast-rising issue thatthreatens the smooth running of the day-to-day activities of every individual who commutes fromplace to place. This traffic congestion problem may be due to a whole variety of circumstances,whether controllable or uncontrollable and has made the need to develop new, innovative ways tocontrol traffic and reduce the occurrence of traffic jams very pertinent, especially on the majorroads in Ghana.This project focuses on Emergency Vehicles (Ambulances, fire trucks and police cars). Using theOkponglo Intersection as a case study, the aim of our project is to develop a system that will beable to detect when an emergency vehicle is at a distance close enough to a traffic light orintersection and adjust the traffic flow pattern by switching to a blinking red light to allow theemergency vehicle to pass freely. Thereby the response time of the Emergency Vehicles willreduce and hence more lives and properties will be saved in case of disasters.The hardware module comprises of an Arduino Uno microcontroller used for signal processingand filtering, a Wi-Fi module for communication between the Emergency Vehicle and theintersection, a GPS module embedded in the mobile phone of the driver of the vehicle and a modelof a traffic light made with LEDs. A web portal was built using the svelte JavaScript library; itwas used for administrative purposes such as registering vehicles and drivers and trafficmanagement. All the data collected are stored in a Firebase database. An android app calledPREEMPT was developed for use by registered emergency vehicle drivers. The PREEMPT appwas designed to provide the driver with the shortest route to an entered destination, as well as sendperiodic updates on location to the control station so that the appropriate actions are taken as andwhen needed. The individual hardware and software models performed as expected. Afterintegration of the hardware and the software, the fulfilled its purpose.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker2162803991176490331-1649274408673.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624dee2bf49988002311f74b", "name": "A NOVEL AUTOMATED TRAFFIC CONTROL SYSTEM FOR EMERGENCY VEHICLES USING GPS FELBAH ELSIE AMONUAH , MILLS KELVIN AMANING,  TIJANI SHERIFF(10663466)(10682615)(10670515)", "description": "A NOVEL AUTOMATED TRAFFIC CONTROL SYSTEM FOR EMERGENCY VEHICLES USING GPS", "author": "sherrif@gmail.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T19:46:51.888Z", "__v": 0, "id": "624dee2bf49988002311f74b"}, {"introduction": "", "abstract": "In the current day situation, we mostly realize the overflow of waste in bins and trash cans atcertain unexpected places especially residential areas. Waste continues to spill over day by day inthese places because of the higher rate of expansion of residential areas. Our population isdefinitely proportional to the amount of waste generated and this accounts for the rapid generationof waste in residential areas.Based on research conducted by Quartz Africa, there has been an indication that, while wastemanagement is a widespread issue in Ghana, Accra seems to be the most affected city creatingfrom about 2,000 to 3,000 metric tonnes of waste within 24 hours. In 2012, the World Bankevaluated that the fall in Ghana's economy was due to poor sanitation. [1]Given this, we intend to propose a unified system of both software and hardware that is based onthe concept of eliminating all these issues by enabling anyone to dispose of their trash at any pointof time at their convenience. The software i.e., the mobile app would have a customer and a driveraspect where the customer can schedule or order for immediate garbage pickup at any time. Itwould make use of Global Positioning System (GPS) to enable real time tracking of the locationof the connected pickup driver. [2]Here, the customer would be connected to a nearby user who has already signed up as a driver onthe app and is currently online. One can also have a real-time feed of the driver's location as heapproaches the customer. Another phase of this project aims at aiding individuals to keep track ofthe garbage levels in their cans and bins by introducing an IT hardware system. The deviceconsists of an ultrasonic sensor, an Arduino UNO, and a Wi-Fi module that would communicateto servers and give feedback to the mobile app. Fairly, everything that happens on the hardwarephase is subsequently shown in the software thus, the percentage of rubbish in the bin is displayedin the mobile app.This is what our project seeks to do to curb the problem and to ensure a safe and healthyenvironment.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker8563266672874027104-1649275220280.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624df158f49988002311f754", "name": "MART WASTE MANAGEMENT SYSTEM FOR RESIDENTIAL AREAS MORTEY EMMANUEL KWESI (10688209),EDUFUL MAXWELL ACQUAH (10683610)", "description": "MART WASTE MANAGEMENT SYSTEM FOR RESIDENTIAL AREAS", "author": "MAXWELL@GMAIL.COM", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T20:00:24.732Z", "__v": 0, "id": "624df158f49988002311f754"}, {"introduction": "", "abstract": "AbstractIn the current day situation, we mostly realize the overflow of waste in bins and trash cans atcertain unexpected places especially residential areas. Waste continues to spill over day by day inthese places because of the higher rate of expansion of residential areas. Our population isdefinitely proportional to the amount of waste generated and this accounts for the rapid generationof waste in residential areas.Based on research conducted by Quartz Africa, there has been an indication that, while wastemanagement is a widespread issue in Ghana, Accra seems to be the most affected city creatingfrom about 2,000 to 3,000 metric tonnes of waste within 24 hours. In 2012, the World Bankevaluated that the fall in Ghana's economy was due to poor sanitation. [1]Given this, we intend to propose a unified system of both software and hardware that is based onthe concept of eliminating all these issues by enabling anyone to dispose of their trash at any pointof time at their convenience. The software i.e., the mobile app would have a customer and a driveraspect where the customer can schedule or order for immediate garbage pickup at any time. Itwould make use of Global Positioning System (GPS) to enable real time tracking of the locationof the connected pickup driver. [2]Here, the customer would be connected to a nearby user who has already signed up as a driver onthe app and is currently online. One can also have a real-time feed of the driver's location as heapproaches the customer. Another phase of this project aims at aiding individuals to keep track ofthe garbage levels in their cans and bins by introducing an IT hardware system. The deviceconsists of an ultrasonic sensor, an Arduino UNO, and a Wi-Fi module that would communicateto servers and give feedback to the mobile app. Fairly, everything that happens on the hardwarephase is subsequently shown in the software thus, the percentage of rubbish in the bin is displayedin the mobile app.This is what our project seeks to do to curb the problem and to ensure a safe and healthyenvironment.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker1018051620688430326-1649277097874.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624df8abf49988002311f761", "name": "SOUND POLLUTION MONITORING ANDCONTROLLER SYSTEM ERIC ASAMOAH-BOATENG 10675574 THOMPSON OFORI ERNEST10661427", "description": "SOUND POLLUTION MONITORING ANDCONTROLLER SYSTEM", "author": "eric@gmail.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T20:31:39.901Z", "__v": 0, "id": "624df8abf49988002311f761"}, {"introduction": "", "abstract": "Agriculture being the strong hold of Ghana's economy is being gradually threatened by diseasescausing significant losses to farmers and threatening the economy of the country. Cash crops ingeneral are resourceful and are the boosters of the country's economy, due to this we based ourproject on detecting diseases that affect cash crops such as cocoa; black pod disease, frosty poddisease and healthy pods of cocoa. Coffee; cercospora, rust, phora, and miner whiles cotton wasclassified as to whether the plant or leaf was diseased or healthy. Farmers in Ghana face a lot ofissues in the sector due to the fact that they are not able to detect the diseases in their earlystages, they also are not able to sometimes determine the type of disease of affecting the crophence the urgency to reduce the spread would be lost leading to destruction of crop yields andwaste of manpower. Another issue worth discussing is the fact that they import experts to detectthe disease physically or manually, this is not only a waste of resources but also risky sincemistakes could be done. A lot of researchers have researched on the topic and a lot has been doneto solve it. Some of which involved building an image processing system, using cameras to takepictures and through computer vision tried to solve it in which all had their disadvantages and weemphatically listed all their flaws in our reviews. We introduced a new approach based onconvolutional neural network and machine learning with the help of drones serving as carriers toour hardware (raspberry pi camera and raspberry pi model 4) which takes real time images andsends it to the server for instant prediction. The goal of this project is to detect, identify and toaccurately predict the type of disease affecting the cash crop. The proposed system is very", "document": "", "image": "", "images": [], "rating": 0, "numReviews": 0, "_id": "624dfb91f49988002311f771", "name": "CASH CROP DISEASE DETECTION USING MACHINE LEARNING ANDUNMANNED AERIAL VEHICLE YUSSIF ISSAH GYANKO 10661098 AWUAH YEBOAH RANSFORD 10667147 OWIREDU FRANCISCA 10689958", "description": "CASH CROP DISEASE DETECTION USING MACHINE LEARNING ANDUNMANNED AERIAL VEHICLE", "author": "isah@outlook.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T20:44:01.919Z", "__v": 0, "id": "624dfb91f49988002311f771"}, {"introduction": "", "abstract": "Studies on the efficient use of TV frequency spectrum have revealed and proven that TVfrequency spectrum in most geographical areas are underutilized. This is noted to be verydominant in especially rural areas. This is attributed to the emergence of currenttelecommunication innovations including 5G and others causing the adoption of DigitalTerrestrial Television Broadcast all over the world. These innovations been implemented on alarge scale in many countries and continents around the world. In many African countries, thejourney of fully adopting these innovations is still in its early days. Among the recentinnovations tackling the provision of broadband internet to rural areas is TVWS. TVWS is anemerging concept that was realized while studying the effective management of TV spectrumin various regions around the World. In Ghana, the migration of TV stations to digitalbroadcasting in recent years has unveiled research towards the implementation of TVWS inthe TV band to tackle the problems of internet access in the country on a large scale. This thesispresents the definition of a propagation model that best describes the path loss measured fromTVWS communication network per distance in Accra using the University of Ghana as a casestudy. In this study, @ TVWS network was setup and demonstrated the use of a Geo-locationDatabase for the assignment of operating channels to avoid interference. A management systemwas implemented for the regulatory body of the TVWS resource and the operation alongsidethe Geo-location database was demonstrated. The network performance was analyzed atvarious periods of time and through various channel frequency bands to understand the effectof geographical features and environmental conditions on the network. Also signal strengthmeasurements were performed at a number of locations in the area of study and the path losswas deduced from these measurements per distance. Finally, a proposed propagation modeldescribing the nature of TVWS network in the area of study is realized though statistical andcomparative analysis.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker6568848565595530753-1649278105322.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624dfc9cf49988002311f777", "name": "DEFINING A PROPAGATION MODEL FOR TVWS USE In ACCRA ANTHONIO CEPHAS DELALI - 10671279. ANNAN LESLIE - 10671152", "description": "DEFINING A PROPAGATION MODEL FOR TVWS USE In ACCRA", "author": "ant@sol.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T20:48:28.469Z", "__v": 0, "id": "624dfc9cf49988002311f777"}, {"introduction": "", "abstract": "Our integrated world is an ever-advancing one, with data scale and complexity increasingat a rapid rate. With this in view, the need for high performing data networking systems is on therise than ever before. Optical fiber provides us with the needed bandwidth and speed to achievethis. However, the implementation of these installations is a very challenging task in itself.Development of other servicing channels such as water pipelines and electric cables means thatthe planning and design of these optic pathways are to be tactful and precise. This has not been thecase, more so the country. Unmethodical planting of fiber cables spells out great consequences,contributing towards inhibiting the steady development of a nation. Naturally, measures haveplaced to curb this but mismanagement of funds and inadequate public broadcast has made resultsunyielding.This project presents an investigation intothe route design and analysis of fiberarchitectures, taking into account aerial and underground installments. This involved the use ofscientifically appropriate procedures, along with implementation, examination and gathering ofresults for validation. In our project, we realized to an extent, optimum structural design andadministration of the backend framework of fiber systems. A high-level design was produced,following technical site surveying to which a low-level design is produced. Scientifically-basedprocedures and operations were further suggested in specific areas, with estimation of parameters,gathering of resources and implementation.Testing and analyses were made,followingadjustments where necessary.At the end, losses of 224.84 to 22.04 dB from distances 0.15 km to 5 km were observed.Individual components in the OP architecture contributed to fixed losses of 0.7, 10.5 and 10.6 dBin the OLT, FDT and FAT respectively. Thus, actual losses from cable length and nature of routeranged 1.04 dB to 2.24 dB. A slope of 0.24 dB/km was calculated and this meets the required pathloss of less than 1 dB/km in fiber optic transmissions.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker3596772878706695699-1649278843339.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624dff7df49988002311f784", "name": "OUTSIDE PLANT (OSP) NETWORK DESIGN AND ROUTE ANALYSIS FOR AERIALAND UNDERGROUND FIBER OPTIC INSTALLATIONS ARYEE SHAELIJAH-10682644. MAXIMUS LAMBERT-NTIBREY-10669985", "description": "OUTSIDE PLANT (OSP) NETWORK DESIGN AND ROUTE ANALYSIS FOR AERIALAND UNDERGROUND FIBER OPTIC INSTALLATIONS", "author": "fibre@gmail.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T21:00:45.978Z", "__v": 0, "id": "624dff7df49988002311f784"}, {"introduction": "", "abstract": "Contactless payment allows consumers to pay for goods and services using Near FieldCommunication (NFC) enabled cards. NFC is a short-range high-frequency form ofwireless communication technology and is a subset of Radio-frequency identification(RFID) which makes use of radio waves to communicate between devices. RFID hasbeen used for decades and has been normalised in some parts of the world for tasks suchas checkout point-of-sale systems in stores, asset tracking, and even public transportpayment systems. Over the years, this technology has demonstrated its ability to maketransactions more secure and efficient.Students using University Of Ghana shuttle systems are faced with concerns such asdelays, money shortages due to possible lack of exact change, and during times of apandemic, risk of infection through the transfer of physical cash.Some of theseconcerns apply to the shuttle conductor as well.The goal of this project is to incorporate NFC payments in University Of Ghana shuttlesystems to allow students to make shuttle payments safely and efficiently.The system consists of an NFC card that can be loaded with virtual funds, an NFCreader mounted inside shuttles that charges a student's account, an android applicationlinked to PayStack API that allows students to check their balance and load virtualfunds onto their card using MTN Mobile Money, Vodafone Cash, Airtel-Tigo Cash, andVisa/Mastercard, a server-side database application that manages all user data andtransactions, and an android and web application to grant system administrators limitedaccess to the database and allows for the creation of NFC cards for student use.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker9088548179865289767-1649280638054.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624e0682f49988002311f791", "name": "NFC CONTACTLESS PAYMENT FOR UNIVERSITY SHUTTLES JOSEPH ADOTEY-NYANU—10668125, JOSHUAARYEE THEODOXEAKWAPONG—10689893", "description": "NFC CONTACTLESS PAYMENT FOR UNIVERSITY SHUTTLES", "author": "josh@aol.com", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T21:30:42.391Z", "__v": 0, "id": "624e0682f49988002311f791"}, {"introduction": "", "abstract": "Since the onset of the COVID-19 pandemic, there has been a great shift in normal activitiesacross the world. According to the World Health Organization (WHO), COVID-19 is spreadbetween infected people through close contact and the most effective way to reduce thetransmission of the virus is social distancing. This project seeks to design and developinnovative technological approaches through Bluetooth technology and computer vision toensure compliance with the social distancing protocol.A mobile application was designed that uses Bluetooth technology to track the distancebetween the user and surrounding devices within the range of 1 metre. The mobile applicationscans for any Bluetooth device nearby and upon detection, calculates the distance between theuser's phone and the identified device. Once the device is near the user of the application, theapplication alerts the user in the form of vibrations and sound. Testing of the designed mobileapplication shows that the application can detect devices within the 1 metre range and carryout the necessary alerts as specified by the user.A computer vision system was also developed to monitor the social distance compliance levelamong people. This system leverages the OpenCV library and Deep learning based on YOLOtraining datasets. Data frames from a camera feed are fed into the system and the systemidentifies people in the frames and performs a pairwise distance estimation. Upon violationdetection, the images are sent to an administrator to view the violations that occurred. Testingshows that the system has a high accuracy of detecting people and performing distanceestimation between pairs. It also shows that the images and violations are successfully sent tothe administrator for monitoring.The performance of the proposed solutions shows that by leveraging technology, socialdistancing can be adhered to, reducing the transmission of COVID-19.", "document": "", "image": "http://full-spm-api.herokuapp.com/public/uploads/image_picker5865665139977278192-1649281445873.jpg", "images": [], "rating": 0, "numReviews": 0, "_id": "624e09aaf49988002311f79d", "name": "ENFORCING SOCIAL DISTANCING USING BLUETOOTH AND COMPUTER VISION CEPHAS NII AYITTEY HAMMOND (10673309)  EMMANUEL AMOAH NANA ADJEI (10663876) AHORNAM AGBOTSE (10684204)", "description": "ENFORCING SOCIAL DISTANCING USING BLUETOOTH AND COMPUTER VISION", "author": "hammon@aol.cOM", "category": {"_id": "620fe0d51dde1f957ff1749d", "name": "software", "icon": "keyboard", "color": "blue", "__v": 0, "id": "620fe0d51dde1f957ff1749d"}, "dateCreated": "2022-04-06T21:44:10.011Z", "__v": 0, "id": "624e09aaf49988002311f79d"}]